#include <iocslib.h>

    char *test[15][8] ={{ "未定義",    "ESC",      "1",      "2",      "3",      "4",      "5",      "6"},
                        {      "7",      "8",      "9",      "0",      "-",      "^",     "\\",     "BS"},
                        {    "TAB",      "Q",      "W",      "E",      "R",      "T",      "Y",      "U"},
                        {      "I",      "O",      "P",      "@",      "[",     "CR",      "A",      "S"},
                        {      "D",      "F",      "G",      "H",      "J",      "K",      "L",      ";"},
                        {      ":",      "]",      "Z",      "X",      "C",      "V",      "B",      "N"},
                        {      "M",      ",",      ".",      "/",      "_",     "SP",   "HOME",    "DEL"},
                        { "RollUP", "RLDown",   "UNDO",     "←",     "↑",     "→",     "↓",    "CLR"},
                        {      "/",      "*",      "-",      "7",      "8",      "9",      "+",      "4"},
                        {      "5",      "6",      "=",      "1",      "2",      "3",  "ENTER",      "0"},
                        {      ",",      ".",   "記号",   "登録",   "HELP",    "XF1",    "XF2",    "XF3"},
                        {    "XF4",    "XF5",   "かな",  "ﾛｰﾏ字", "コード",   "CAPS",    "INS",  "ﾋﾗｶﾞﾅ"},
                        {   "全角",  "BREAK",   "COPY",     "F1",     "F2",     "F3",     "F4",     "F5"},
                        {     "F6",     "F7",     "F8",     "F9",    "F10", "未定義", "未定義", "未定義"},
                        {  "SHIFT",   "CTRL",  "OPT.1",  "OPT.2", "未定義", "未定義", "未定義", "未定義"}};

   int  pushed[15][8] ={{        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0}};

  int pushing[15][8] = {{        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0},
                        {        0,        0,        0,        0,        0,        0,        0,        0}};

void main()
{
	OS_CUROF();
	B_CLR_AL();
	
	B_PUTMES ( 7, 60,  4, 127, (unsigned char *)"ﾅﾝﾁｬｯﾃ KEYBOARD CHECKER");
	B_PUTMES ( 7, 60,  5, 127, (unsigned char *)"2025 Gyrowave.");
	
	do
	{   /* 全キーグループについてグループごとに処理 */
		int y;
		for( y=0; y < 15; y++)
		{
			putmatrix( y);
			getmatrix( y);
		}
	} while ( pushing[14][1] * pushing[5][4] == 0);  /* [CTRL] + [C] to abort. */

	B_CLR_AL();
	B_COLOR( 3);
	
	do
	{   /* プログラム終了後に文字がゴチャゴチャ出るのを防ぐ */
		B_KEYINP();
	
	} while ( B_KEYSNS() != 0);
    
	OS_CURON();

	/* TODO:
	   ・どうやったら[COPY]キーを押しても白窓が開かなくできるか
	*/

}


int putmatrix(int y)
{   /* キーグループごとの押下状況を出力 */
    const int MAX_STRING_LENGTH = 7;
	int x;
	for (x = 0; x < 8; x++)
	{
		 B_PUTMES ( 5 + pushed[y][x] + pushing[y][x], 
			        x * MAX_STRING_LENGTH, 
			        y * 2, 
			        MAX_STRING_LENGTH, 
		 			(unsigned char *)test[y][x]);
	}
	return 0;
}

int getmatrix(int y)
{   /* キーグループごとの押下状況を入力 */
	int x, key_code;
	key_code = BITSNS ( y);
	
	for (x = 0; x < 8; x++)
	{
		if ((key_code >> x)&1 == 1)
		{
			pushing[y][x] = 9;
			pushed[y][x] =  1;
		}else
		{
			pushing[y][x] = 0;
		}
	}
	return 0;
}